app/Http/Controllers/Web/BrowseController.php

select * from `bootcamp_category`
select * from `bootcamp_member` where `bootcamp_member`.`bootcamp_id` in ('2', '3', '4', '5', '6')
select * from `bootcamp` where `bootcamp`.`bootcamp_category_id` in ('1', '2', '3', '4', '5')
select * from `contributors` where `contributors`.`id` in ('22')
---
    public function index(){
        //load data dengan eager loading
        $bootcat = BootcampCategory::with('bootcamp.contributor', 'bootcamp.bootcamp_member', 'bootcamp.course')->get();

select * from `bootcamp_category` where `slug` = 'programming' limit 1
select * from `bootcamp_category` where `bootcamp_category`.`id` in ('1', '2') and `slug` = 'programming'
select * from `bootcamp_member` where `bootcamp_member`.`bootcamp_id` in ('2', '3', '5', '6')
select * from `bootcamp` where `bootcamp_category_id` = '2' limit 8 offset 0
select * from `contributors` where `contributors`.`id` in ('22')
select * from `bootcamp_category`
select * from `bootcamp_category` where `bootcamp_category`.`id` in ('1') and `slug` = 'programming'
select * from `bootcamp` where `bootcamp_category_id` = '2' order by `created_at` asc limit 2
---
    public function detail($slug){
        $bucat = BootcampCategory::where('slug', $slug)->first();
        $boot = Bootcamp::with(['bootcamp_category' => function ($query) use ($slug){
            $query->where('slug', $slug);}], 'contributor', 'bootcamp_member', 'course')->where('bootcamp_category_id', $bucat->id)->paginate(8);
        $cat = BootcampCategory::all();
        $new = Bootcamp::with(['bootcamp_category' => function ($query) use ($slug){
            $query->where('slug', $slug);}], 'contributor', 'bootcamp_member', 'course')->where('bootcamp_category_id', $bucat->id)->orderBy('created_at', 'asc')->take(2)->get();