app/Http/Controllers/Web/HomeController.php

select * from `categories` where `enable` = '1'
---
	public function index() {
		# code...
		$now = new DateTime();
		if(Auth::guard('members')->user()){
            $mem_id      = Auth::guard('members')->user()->id;
          }else{
            $mem_id      = 0;
        }

		$categories = Category::where('enable', '=', 1)->get();

select * from `lessons` where `enable` = '1' and `status` = '1' order by `id` desc
select * from `lessons` where `enable` = '1' and `status` = '1' order by `id` asc
select * from `invoice` where `status` = '1' and `members_id` = '0' limit 1
---
				->where('lessons.status', 1)
				->orderBy('id','DESC')->get();
            }else{
				$newlessons = Lesson::where('enable', '=', 1)->where('status', 1)->orderBy('id','DESC')->get();
                $lessons = Lesson::where('enable', '=', 1)
				   ->where('status', 1)
				   ->orderBy('id','ASC')->get();
        }

		$invoice = Invoice::where('status', '=', 1)->where('members_id', '=', $mem_id)->first();

select * from `categories` where `enable` = '1'
select * from `lessons` where `enable` = '1' and `status` = '1' order by `id` desc
---
			$cekdulu =[''];
		}
    	$now = new DateTime();
		$categories = Category::where('enable', '=', 1)->get();
		$newlessons = Lesson::where('enable', '=', 1)->where('status', 1)->orderBy('id','DESC')->get();

select * from `lessons` where `enable` = '1' and `status` = '1' order by `id` desc
select * from `lessons` where `enable` = '1' and `status` = '1' order by `id` asc
---
					->where('lessons.status', 1)
					->orderBy('id','DESC')->get();
            }else{
				$newlessons = Lesson::where('enable', '=', 1)->where('status', 1)->orderBy('id','DESC')->get();
                $lessons = Lesson::where('enable', '=', 1)
				   ->where('status', 1)
				   ->orderBy('id','ASC')->get();

select * from `invoice` where `status` = '1' and `members_id` is null limit 1
---
		// $tutorial = TutorialMember::where('member_id', $mem_id)->where('lesson_id', $lessons->id)->get();
		// $cart = Cart::where('member_id', $mem_id)->where('lesson_id', $lessons->id)->get();
		// dd($tutorial);
		$invoice = Invoice::where('status', '=', 1)->where('members_id', '=', $mem_id)->first();