app/Support/helpers.php

    public static function getTotalVideo($lesson_id)
    {
        $data = Video::where('enable', 1)->where('lessons_id', $lesson_id)->count();
---
select count(*) as aggregate from `videos` where `enable` = '1' and `lessons_id` = '90'

    public static function pageMenu()
    {
        $pages = Page::where('enable', 1)->paginate(3);
---
select * from `pages` where `enable` = '1' limit 3 offset 0
select count(*) as aggregate from `pages` where `enable` = '1'

function getCategory()
{
    $categories = Category::all();
---
select * from `categories`

function getTotalCart()
{
    $member_id = Auth::guard('members')->user()->id ?? null;
    $data = Cart::where('member_id', $member_id)->count();
---
select count(*) as aggregate from `cart` where `member_id` is null